#+BEGIN_COMMENT
.. title: The Case of the Frozen Lake
.. slug: the-case-of-the-frozen-lake
.. date: 2018-07-17 16:58:44 UTC-07:00
.. tags: markov tutorial
.. category: tutorial
.. link: 
.. description: Solving the Frozen Lake problem using Markov Decision Processes. 
.. type: text
#+END_COMMENT

* The Environment
  The OpenAI Gym provides a Frozen Lake environment. This is the general description for this type of environment.

#+BEGIN_EXAMPLE
Type:            TimeLimit
String form:     <TimeLimit<FrozenLakeEnv<FrozenLake-v0>>>
File:            ~/.virtualenvs/reinforcement-learning/lib/python3.6/site-packages/gym/wrappers/time_limit.py
Docstring:       <no docstring>
Class docstring:
The main OpenAI Gym class. It encapsulates an environment with
arbitrary behind-the-scenes dynamics. An environment can be
partially or fully observed.

The main API methods that users of this class need to know are:

    step
    reset
    render
    close
    seed

And set the following attributes:

    action_space: The Space object corresponding to valid actions
    observation_space: The Space object corresponding to valid observations
    reward_range: A tuple corresponding to the min and max possible rewards

Note: a default reward range set to [-inf,+inf] already exists. Set it if you want a narrower range.

The methods are accessed publicly as "step", "reset", etc.. The
non-underscored versions are wrapper methods to which we may add
functionality over time.
#+END_EXAMPLE

We'll make it.

#+BEGIN_SRC ipython :session frozen :results none
environment = gym.make('FrozenLake-v0')
#+END_SRC

The =observation_space= for the environment is the lake. Here's its size.

#+BEGIN_SRC ipython :session frozen :results output
print(environment.observation_space.n)
#+END_SRC

#+RESULTS:
: 16

It's 16 because we're using a 4 x 4 grid.

#+BEGIN_SRC ipython :session frozen :results output
print(environment.action_space.n)
#+END_SRC

#+RESULTS:
: 4

#+BEGIN_SRC ipython :session frozen :results output
print(environment.reward_range)
#+END_SRC

#+RESULTS:
: (0, 1)

